In [1]:
!pip install pandas

Requirement already satisfied: pandas in /home/coder/miniconda3/lib/python3.11/site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in /home/coder/miniconda3/lib/python3.11/site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/coder/miniconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/coder/miniconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /home/coder/miniconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /home/coder/miniconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c','d']
my_list = [10, 20, 30, 40]
arr = np.array(my_list)
dict1 = {'a':10,'b':20,'c':30,'d':40}

In [11]:
series = pd.Series(my_list)
series = pd.Series(data=my_list)
print(type(series))

<class 'pandas.core.series.Series'>

In [13]:
series = pd.Series(data=my_list, index=labels)
series

a    10
b    20
c    30
d    40
dtype: int64

In [15]:
series['a']

10

In [18]:
series = pd.Series(arr)
series = pd.Series(arr, index=labels)
series

a    10
b    20
c    30
d    40
dtype: int64

In [20]:
series = pd.Series(dict1)
series

a    10
b    20
c    30
d    40
dtype: int64

In [24]:
series = pd.Series([330, 67, 38, 125], index=['USA','UK','Canada','Japan'])
series

USA       330
UK         67
Canada     38
Japan     125
dtype: int64

In [25]:
series['USA']

330

#### DataFrames
- bunch of series which share the same index/labels
- Series in DataFrame can have col names

In [29]:
df = pd.DataFrame(np.random.randn(5,4))
df = pd.DataFrame(np.random.randn(5,4), index=['A','B', 'C','D','E'])
df = pd.DataFrame(np.random.randn(5,4), index=['A','B', 'C','D','E'], columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [31]:
type(df['W'])

pandas.core.series.Series

In [35]:
col_name = 'X'
df[col_name]

A   -0.281111
B    0.597602
C    1.761426
D    1.566062
E   -1.581530
Name: X, dtype: float64

In [37]:
df.W # SQL style

A    0.474624
B    1.850803
C   -0.716629
D   -1.050965
E    0.896103
Name: W, dtype: float64

In [38]:
df

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [42]:
type(df[['X','Y']])

pandas.core.frame.DataFrame

In [44]:
df[['X','Y']]

          X         Y
A -0.281111  0.234445
B  0.597602 -1.235011
C  1.761426  2.102435
D  1.566062  0.442230
E -1.581530 -0.263377

In [45]:
df

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [69]:
df['K'] = 1 # all rows have same value 
df['K'] = [1,2,3,4,5]
df['K'] = df['W']
df['K'] = df['X'] + df['Y']
df

          W         X         Y         Z         K
A  0.474624 -0.281111  0.234445 -0.501310 -0.046666
B  1.850803  0.597602 -1.235011 -0.073207 -0.637408
C -0.716629  1.761426  2.102435  1.160021  3.863861
D -1.050965  1.566062  0.442230 -0.681241  2.008292
E  0.896103 -1.581530 -0.263377  0.172659 -1.844906

In [50]:
df['W']

A    0.474624
B    1.850803
C   -0.716629
D   -1.050965
E    0.896103
Name: W, dtype: float64

In [52]:
df.loc['A'] # fetch a row as a Series

W    0.474624
X   -0.281111
Y    0.234445
Z   -0.501310
K   -0.046666
Name: A, dtype: float64

In [54]:
df.iloc[2]

W   -0.716629
X    1.761426
Y    2.102435
Z    1.160021
K    3.863861
Name: C, dtype: float64

In [55]:
df

          W         X         Y         Z         K
A  0.474624 -0.281111  0.234445 -0.501310 -0.046666
B  1.850803  0.597602 -1.235011 -0.073207 -0.637408
C -0.716629  1.761426  2.102435  1.160021  3.863861
D -1.050965  1.566062  0.442230 -0.681241  2.008292
E  0.896103 -1.581530 -0.263377  0.172659 -1.844906

In [58]:
df.loc[['A','C']]

          W         X         Y         Z         K
A  0.474624 -0.281111  0.234445 -0.501310 -0.046666
C -0.716629  1.761426  2.102435  1.160021  3.863861

In [59]:
df.loc['C']['X']

1.7614262007571644

In [60]:
df.loc['C','X']

1.7614262007571644

In [61]:
df

          W         X         Y         Z         K
A  0.474624 -0.281111  0.234445 -0.501310 -0.046666
B  1.850803  0.597602 -1.235011 -0.073207 -0.637408
C -0.716629  1.761426  2.102435  1.160021  3.863861
D -1.050965  1.566062  0.442230 -0.681241  2.008292
E  0.896103 -1.581530 -0.263377  0.172659 -1.844906

In [63]:
df.loc[['A','C'],['X']]

          X
A -0.281111
C  1.761426

In [64]:
df.loc[['A','C'],['X','Y']]

          X         Y
A -0.281111  0.234445
C  1.761426  2.102435

In [70]:
df

          W         X         Y         Z         K
A  0.474624 -0.281111  0.234445 -0.501310 -0.046666
B  1.850803  0.597602 -1.235011 -0.073207 -0.637408
C -0.716629  1.761426  2.102435  1.160021  3.863861
D -1.050965  1.566062  0.442230 -0.681241  2.008292
E  0.896103 -1.581530 -0.263377  0.172659 -1.844906

In [71]:
# changes to a DataFrame will create and return a new DataFrame with changes in it
df2 = df.drop('K', axis=1) # axis=1 implies col
df2

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [73]:
# inplace=True will modify the DataFrame and will not create a new DataFrame
df.drop('K', axis=1, inplace=True) # axis=1 implies col
df

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [74]:
df

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [76]:
df.drop('A')

          W         X         Y         Z
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [77]:
df

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [78]:
df[df['W'] > 0] # Fetch rows where 'W' is positive

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
E  0.896103 -1.581530 -0.263377  0.172659

In [80]:
df[df['W'] > 0][['W','X']] # Fetch rows where 'W' is positive and filter to fetch specified cols (W and X)

          W         X
A  0.474624 -0.281111
B  1.850803  0.597602
E  0.896103 -1.581530

In [81]:
df

          W         X         Y         Z
A  0.474624 -0.281111  0.234445 -0.501310
B  1.850803  0.597602 -1.235011 -0.073207
C -0.716629  1.761426  2.102435  1.160021
D -1.050965  1.566062  0.442230 -0.681241
E  0.896103 -1.581530 -0.263377  0.172659

In [83]:
df[(df['W'] > 0) & (df['Y'] > 0)]

          W         X         Y        Z
A  0.474624 -0.281111  0.234445 -0.50131

#### Missing data

In [85]:
df = pd.DataFrame({
        'A':[1, 2, np.nan],
        'B':[4, np.nan, np.nan],
        'C':[7, 8, 9], 
})

df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [86]:
df.dropna() # drop rows which have atleast one missing col

     A    B  C
0  1.0  4.0  7

In [87]:
df.dropna(axis=1) # drop cols which have atleast one missing data

   C
0  7
1  8
2  9

In [88]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [89]:
df.dropna(thresh=2) #retain rows which have atleast 2 non-null values

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [90]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [91]:
df.dropna(thresh=2, axis=1) #retain cols which have atleast 2 non-null values

     A  C
0  1.0  7
1  2.0  8
2  NaN  9

In [92]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [93]:
df.fillna(0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  8
2  0.0  0.0  9

In [94]:
df.fillna(df.mean()) # fill missing column data with mean of the column

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  8
2  1.5  4.0  9

#### Reading data

In [95]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [97]:
df.to_csv('example2.csv', index=False)
print('File saved')

File saved

In [98]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /home/coder/miniconda3/lib/python3.11/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/coder/miniconda3/lib/python3.11/site-packages (from openpyxl) (1.1.0)

In [99]:
df.to_excel('example.xlsx', sheet_name='my-sheet', index=False)
print('Excel File saved')

Excel File saved

In [100]:
df = pd.read_excel('example.xlsx')
df

    a    b    c    d
0   0  100  200  300
1   4    5    6    7
2   8    9   10   11
3  12   13   14   15

In [101]:
!pip install lxml

Requirement already satisfied: lxml in /home/coder/miniconda3/lib/python3.11/site-packages (4.9.3)

In [102]:
!pip install html5lib

Requirement already satisfied: html5lib in /home/coder/miniconda3/lib/python3.11/site-packages (1.1)
Requirement already satisfied: six>=1.9 in /home/coder/miniconda3/lib/python3.11/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /home/coder/miniconda3/lib/python3.11/site-packages (from html5lib) (0.5.1)

In [103]:
# creates an Array of DataFrames
df_array = pd.read_html('https://www.w3schools.com/html/html_tables.asp')
df_array[0]

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy